Autodesk.Revit.DB.Analysis.PathOfTravelCalculationServiceData.SetStatus(System.Collections.Generic.IList{Autodesk.Revit.DB.Analysis.PathOfTravelCalculationStatus})
Sets the result status of the calculation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2020

Autodesk.Revit.DB.Analysis.PathOfTravelCalculationServiceData.SetPathOfTravelPoints(System.Collections.Generic.IList{System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ}})
Sets the source or calculated points passed between Revit and calculation server.
Remarks:
Source points are start and end points plus all possible waypoints between them.
Calculated points are actual points of the PathOfTravel that are displayed in the view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2020

Autodesk.Revit.DB.Analysis.PathOfTravelCalculationServiceData.SetEndPoints(System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ})
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2020

Autodesk.Revit.DB.Analysis.PathOfTravelCalculationServiceData.SetStartPoints(System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ})
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2020